root-2.3.0/run/tutorials/heatTransfer/buoyantPimpleFoam/hotRoom/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication setFields
runApplication $application

# ----------------------------------------------------------------- end-of-file
